app/Controllers/Vigilantes.php

    public function valida()
    {

        $usuario = $this->request->getVar('user');
        $password = $this->request->getVar('password');
        $datos = $this->vigilante->where('user', $usuario)->first();
        if ($datos != null && $datos['activo'] == 1) {
            if (password_verify($password, $datos['password'])) {
                $this->vigilante->where('id_v', $datos['id_v'])->set('iniciado', 1)->update();
                $datos = $this->vigilante->where('user', $usuario)->first();
---
SELECT *
FROM `vigilantes`
WHERE `user` = 'admin'
 LIMIT 1
UPDATE `vigilantes` SET `iniciado` = 1
WHERE `id_v` = '1'

    public function listar_v()
    {
        if (session()->get('user') == 'admin' and session()->get('activo') == '1') {

            $registrado = $this->request->getGet('registrado') == 1;

            $datos['registrado'] = $registrado;
            $datos['vigilantes'] = $this->vigilante->orderBy('id_v', 'ASC')->findAll();
---
SELECT *
FROM `vigilantes`
ORDER BY `id_v` ASC

    public function guardar_v()
    {
        if (session()->get('user') == 'admin' and session()->get('activo') == '1') {

            $user = $this->request->getVar('usuario');
            $password = $this->request->getVar('password');
            $passowrd_hash = password_hash($password, PASSWORD_DEFAULT);
            $nombre = $this->request->getVar('nombre');
            $telefono = $this->request->getVar('telefono');
            $fecha = $this->request->getVar('fecha');
            $fecha_format = date('Y-m-d H:i:s', strtotime($fecha));

            $datos = [
                'user' => strtolower($user),
                'password' => $passowrd_hash,
                'nombre' => strtoupper($nombre),
                'telefono' => $telefono,
                'fechar_vigilante' => $fecha_format
            ];
            $valida = $this->vigilante->where('user', $user)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `vigilantes`
WHERE `user` = 'renato.calymayor'

    public function logout()
    {
        if (session()->get('activo') == '1') {

            $datos = $this->vigilante->where('user', session()->get('user'))->first();

            $this->vigilante->where('id_v', $datos['id_v'])->set('iniciado', 0)->update();
---
SELECT *
FROM `vigilantes`
WHERE `user` = 'admin'
 LIMIT 1
UPDATE `vigilantes` SET `iniciado` = 0
WHERE `id_v` = '1'